{
    "$": "jQuery like style dom manipulator. TODO",
    "$attr": "Element attribute manipulation.",
    "$class": "Element class manipulations.",
    "$css": "Element css manipulation.",
    "$data": "Wrapper of $attr, adds data- prefix to keys.",
    "$event": "bind events to certain dom elements. TODO",
    "$insert": "Insert html on different position.",
    "$offset": "Get the position of the element in document.",
    "$property": "Element property html, text, val getter and setter.",
    "$remove": "Remove the set of matched elements from the DOM.",
    "$safeEls": "Convert value into an array, if it's a string, do querySelector.",
    "$show": "Show elements.",
    "Class": "Create JavaScript class.",
    "Emitter": "Event emitter class which provides observer pattern.",
    "Select": "Simple wrapper of querySelectorAll to make dom selection easier.",
    "State": "Simple state machine.",
    "Uri": "TODO",
    "after": "Create a function that invokes once it's called n or more times.",
    "ajax": "Perform an asynchronous HTTP request.",
    "ajax.server": "No description.",
    "allKeys": "Retrieve all the names of object's own and inherited properties.",
    "before": "Create a function that invokes less than n times.",
    "bind": "Create a function bound to a given object.",
    "camelCase": "Convert string to \"camelCase\".",
    "capitalize": "Convert the first character to upper case and the remaining to lower case.",
    "clone": "Create a shallow-copied clone of the provided plain object.",
    "cloneDeep": "TODO",
    "contain": "Check if the value is present in the list.",
    "cookie": "Simple api for handling browser cookies.",
    "createAssigner": "Used to create extend, extendOwn and defaults.",
    "defaults": "Fill in undefined properties in object with the first value present in the following list of defaults objects.",
    "define": "Define a module, should be used along with use.",
    "delay": "Invoke function after certain milliseconds.",
    "delegate": "TODO",
    "difference": "Create an array of unique array values not included in the other given array.",
    "dotCase": "Convert string to \"dotCase\".",
    "each": "Iterates over elements of collection and invokes iteratee for each element.",
    "endWith": "Check if string ends with the given target string.",
    "escape": "Escapes a string for insertion into HTML, replacing &, <, >, \", `, and ' characters.",
    "escapeRegExp": "Escape special chars to be used as literals in RegExp constructors.",
    "evalCss": "Load css into page.",
    "every": "Check if predicate return truthy for all elements.",
    "extend": "Copy all of the properties in the source objects over to the destination object.",
    "extendDeep": "No description.",
    "extendOwn": "Like extend, but only copies own properties over to the destination object.",
    "extractBlockCmts": "Extract block comments from source code.",
    "filter": "Iterates over elements of collection, returning an array of all the values that pass a truth test.",
    "findKey": "Return the key where the predicate truth test passes or undefined.",
    "flatten": "Recursively flatten an array.",
    "has": "Checks if key is a direct property.",
    "identity": "Return the first argument given.",
    "idxOf": "Get the index at which the first occurrence of value. TODO",
    "indent": "Indent each line in a string.",
    "inherits": "Inherit the prototype methods from one constructor into another.",
    "invert": "Create an object composed of the inverted keys and values of object.",
    "isArgs": "Check if value is classified as an arguments object.",
    "isArr": "Check if value is an `Array` object.",
    "isArrLike": "Check if value is array-like.",
    "isBool": "Check if value is a boolean primitive.",
    "isBuffer": "Check if value is a buffer.",
    "isDate": "Check if value is classified as a Date object.",
    "isEl": "Check if value is a DOM element.",
    "isEmpty": "Check if value is an empty object or array.",
    "isEqual": "Performs an optimized deep comparison between the two objects, to determine if they should be considered equal.",
    "isErr": "Check if value is an error.",
    "isFinite": "Check if value is a finite primitive number.",
    "isFn": "Check if value is a function.",
    "isInt": "Checks if value is classified as a Integer.",
    "isMatch": "Check if keys and values in src are contained in obj.",
    "isMobile": "Check whether client is using a mobile browser using ua.",
    "isNaN": "Check if value is an NaN.",
    "isNull": "Check if value is an Null.",
    "isNum": "Checks if value is classified as a Number primitive or object.",
    "isObj": "Check if value is the language type of Object.",
    "isPlainObj": "TODO",
    "isPrimitive": "Check if value is string, number, boolean or null.",
    "isRegExp": "Check if value is a regular expression.",
    "isRelative": "Check if path appears to be relative.",
    "isStr": "Check if value is a string primitive.",
    "isUndef": "Check if value is undefined.",
    "kebabCase": "Convert string to \"kebabCase\".",
    "keys": "Create an array of the own enumerable property names of object.",
    "last": "Get the last element of array.",
    "loadJs": "Inject script tag into page with given src value. TODO",
    "longest": "Get the longest item in an array.",
    "lpad": "Pad string on the left side if it's shorter than length.",
    "ltrim": "Remove chars or white-spaces from beginning of string.",
    "map": "Create an array of values by running each element in collection through iteratee.",
    "matcher": "TODO",
    "max": "Get maximum value of given numbers.",
    "min": "Get minimum value of given numbers.",
    "mkdir": "Recursively create directories.",
    "negate": "Create a function that negates the result of the predicate function.",
    "noop": "A no-operation function.",
    "now": "Gets the number of milliseconds that have elapsed since the Unix epoch.",
    "objToStr": "Alias of Object.prototype.toString.",
    "once": "Create a function that invokes once.",
    "optimizeCb": "TODO",
    "pad": "Pad string on the left and right sides if it's shorter than length.",
    "partial": "Partially apply a function by filling in given arguments.",
    "pascalCase": "Convert string to \"pascalCase\".",
    "random": "Produces a random number between min and max(inclusive).",
    "repeat": "Repeat string n-times.",
    "restArgs": "This accumulates the arguments passed into an array, after a given index.",
    "root": "Root object reference, `global` in nodeJs, `window` in browser.",
    "rpad": "Pad string on the right side if it's shorter than length.",
    "rtrim": "Remove chars or white-spaces from end of string.",
    "safeCb": "Create callback based on input value. TODO",
    "size": "Get size of object, length of array like object or the number of keys.",
    "slice": "Create slice of source array or array-like object.",
    "snakeCase": "Convert string to \"snakeCase\".",
    "some": "Check if predicate return truthy for any element.",
    "spaceCase": "Convert string to \"spaceCase\".",
    "splitCase": "Split different string case to an array.",
    "startWith": "Check if string starts with the given target string.",
    "stripAnsi": "Strip ansi codes from a string.",
    "stripCmt": "Strip comments from source code.",
    "stripColor": "Strip ansi color codes from a string.",
    "stripHtmlTag": "Strip html tags from a string.",
    "template": "TODO",
    "toArr": "Convert value to an array.",
    "toInt": "Convert value to an integer.",
    "toNum": "Convert value to a number.",
    "toStr": "Convert value to a string.",
    "topoSort": "Topological sorting algorithm.",
    "trim": "Remove chars or white-spaces from beginning end of string.",
    "unescape": "Convert HTML entities back, the inverse of escape.",
    "union": "Create an array of unique values, in order, from all given arrays.",
    "uniqId": "Generate a globally-unique id.",
    "unique": "Create duplicate-free version of an array.",
    "upperFirst": "Convert the first character of string to upper case.",
    "use": "Use modules that is created by define.",
    "values": "Creates an array of the own enumerable property values of object.",
    "wrap": "Wrap the function inside a wrapper function, passing it as the first argument."
}